[
  {
    "slug": "about-ganesh",
    "title": "About Ganesh Vadlamuri",
    "date": "2025-01-10",
    "featured": true,
    "comments": 0,
    "categories": ["Featured", "About"],
    "img": "",
    "excerpt": "Senior Software Engineer with 6 years of expertise in designing scalable web applications, cloud platforms (AWS, Azure, GCP), and Generative AI integration. Currently at Wells Fargo leading fraud detection modernization.",
    "content": "# 👋 Hi, I'm Ganesh Vadlamuri\n\n📍 Charlotte, North Carolina | 📧 ganeshvadlamuri.root@gmail.com | 📱 +1 512-665-3074\n\n## 🚀 Professional Summary\n\nExperienced Software Engineer with **6 years of expertise** in designing, developing, and deploying scalable web applications using Java and Spring Boot. Strong background in building RESTful APIs, integrating databases such as MySQL, MongoDB, and PostgreSQL, and optimizing backend performance for enterprise-grade applications.\n\nSkilled in cloud platforms including **AWS, Azure, and GCP**, with hands-on experience in CI/CD pipelines using Jenkins, Git, and Docker. Proficient in SQL and Python for backend scripting, data manipulation, and process automation. Passionate about modern application architectures, with emerging expertise in **Generative AI** and its integration into full-stack systems, leveraging models such as Gemini and LLaMA to address complex business challenges.\n\n## 🎓 Education\n\n**Master of Science in Computer Science**\nTexas State University, San Marcos, Texas\nGraduated: May 2024 | GPA: 3.5/4.0\n\n## 💼 Professional Experience\n\n### Wells Fargo - Senior Software Engineer\n📍 Charlotte, North Carolina | 🗓️ Dec 2024 – Present\n\n**Fraud Detection Platform Modernization**\n- Leading modernization initiatives including platform migration, upgrades, and cloud readiness for Google Cloud Platform (GCP)\n- Partnered with Cloud Champions, DevOps, and Architecture teams to modernize deployment pipelines on OpenShift and GCP\n- Spearheaded PoC for migrating from PCF to OpenShift, focusing on containerization and cloud-native best practices\n- Led Java upgrade from Java 11 to Java 17 and transitioned microservices to Spring Boot 3.x\n- Resolved critical vulnerabilities, enhancing system security and compliance\n- Applied BDD principles using Cucumber and Gherkin for automated functional testing\n- Enhanced CI/CD pipelines with Artifactory, Docker, and Jenkins\n- Utilized Kafka, MongoDB, and OracleDB for real-time fraud detection\n- Implemented Splunk dashboards and alerts for proactive monitoring\n- Contributed to GenAI-powered PoC for fraud analytics and anomaly detection\n\n### Texas State University - Graduate Software Engineer\n📍 San Marcos, Texas | 🗓️ Aug 2022 – May 2024\n\n**Enterprise Systems & Cloud Infrastructure**\n- Maintained university websites using Java, Spring Boot, Angular, and React with microservices architecture\n- Integrated RESTful APIs with JSON-based data interchange\n- Deployed cloud applications on AWS (EC2, RDS, S3) using Terraform for IaC\n- Containerized applications with Docker and orchestrated with Kubernetes\n- Configured AWS CloudWatch for performance monitoring\n- Developed ETL pipelines and optimized MySQL/PostgreSQL databases\n- Analyzed student performance data using Python, SQL, and Excel\n- Created visualizations in Tableau and Power BI with DAX\n\n### Amazon Web Services - Cloud Engineer\n📍 Remote, India | 🗓️ Mar 2022 – May 2022\n\n**Secure Cloud Solutions**\n- Designed and implemented scalable cloud solutions improving application performance\n- Configured AWS services (EC2, S3, RDS) with focus on security and optimization\n- Developed automation scripts using Python and AWS CLI\n- Leveraged Terraform for Infrastructure as Code\n- Monitored infrastructure via AWS CloudWatch with dashboards and alerts\n- Participated in Agile ceremonies for team productivity\n\n### KSR Marine Exports - Software Engineer\n📍 Andhra Pradesh, India | 🗓️ Jan 2021 – Feb 2022\n\n**Data Engineering & Integration**\n- Designed software components in Java and Python for operational data analysis\n- Built RESTful APIs integrating PostgreSQL and cloud storage (AWS S3, Azure Blob)\n- Implemented ETL pipelines using AWS Glue and Azure Data Factory\n- Developed interactive dashboards in Tableau and Power BI\n- Optimized SQL queries with SonarLint code quality checks\n- Deployed services via Jenkins and UrbanCode Deploy\n- Provided production support using Splunk monitoring\n\n### GNR Health Care - Software Engineer (Data Systems)\n📍 Andhra Pradesh, India | 🗓️ Aug 2018 – Dec 2020\n\n**Healthcare Analytics & Compliance**\n- Designed ETL pipelines using Python, SQL for healthcare data processing\n- Analyzed billing and insurance claims data for discrepancies and patterns\n- Built dashboards in Power BI and Tableau tracking KPIs\n- Optimized SQL queries reducing report generation time by 30%\n- Integrated RESTful APIs for real-time claim status updates\n- Automated recurring reports eliminating 40% of manual effort\n- Monitored production jobs via Jenkins and Splunk\n- Ensured HIPAA compliance in all data workflows\n\n## 🏆 Key Projects\n\n### AWS Superstore Data Analysis Pipeline\nDesigned end-to-end sales data pipeline using AWS S3, AWS Glue, Athena, and QuickSight with secure IAM-based access.\n\n### Car Sales Dashboard with Power BI\nBuilt interactive dashboard tracking KPIs, sales trends, and YOY growth with visualizations by body style, color, and region.\n\n## 🌟 Achievements & Leadership\n\n- 🎤 **Volunteer** at Rotary Club International - Plastic reduction initiatives in Visakhapatnam\n- 👨🏫 **Success Coach** at Texas State University - US Seminar Class\n- 🩸 **NSS Organizer** - Blood Donation Camps, Beach Cleanups, Village development\n- 🎪 **Event Lead** - \"Tarang\" festival with 1,700+ attendees, hackathons, and workshops\n\n## 💡 What Drives Me\n\n> **\"Build it right. Secure it better.\"**\n\nI believe in:\n- 🔒 **Security by Design** - Not an afterthought\n- 🚀 **Performance at Scale** - Systems that grow with demand\n- 📊 **Data-Driven Decisions** - Metrics over opinions\n- 🤝 **Collaborative Innovation** - Best ideas win\n- 📚 **Continuous Learning** - Technology never stops evolving\n\n## 📫 Let's Connect\n\n**Ready to build something amazing together?**\n[Schedule a call](https://calendly.com/ganeshvadlamuri-root/30min) | [LinkedIn](https://linkedin.com/in/ganeshvadlamuri) | [GitHub](https://github.com/ganeshvadlamuri)\n\n---\n\n*Last updated: January 2025*"
  },
  {
  "slug": "ieee-silcon-2025-presentation",
  "title": "Financial Fraud Detection in Shopping Sites using Generative AI",
  "date": "2025-11-08",
  "categories": ["Conference", "Research"],
  "img": "assets/IeeeFraudDetection.png",
  "excerpt": "Presented a research paper at the 2025 IEEE Silchar Subsection Conference (SILCON-2025) organized by NIT Nagaland.",
  "content": "## Introduction\nOnline shopping has grown rapidly, especially after the COVID-19 pandemic. With increased dependency on digital payments and home deliveries, financial fraud has also risen. Fraud often occurs through manipulated deliveries, misleading reviews, or unauthorized access. Prior research shows that nearly **25% of online transactions are wrongly declined**, and younger customers are more vulnerable to fraud. This motivated the development of an AI-driven fraud detection system.\n\n## Motivation\nTraditional, rule-based fraud detection methods are limited and cannot handle complex, evolving fraud patterns. This project integrates **Generative AI** with machine learning to:\n- Identify emotional tone and hidden patterns in product reviews.\n- Analyze user behavior to detect anomalies.\n- Provide a data-driven framework that adapts to new fraud techniques.\n\n## Dataset Used\nThe dataset is sourced from the **Kaggle Amazon Product Reviews** repository with **568,454 reviews** and **10 features** (seller details, payment data, product info, reviews, etc.). Preprocessing includes:\n- Removing unnecessary columns\n- Handling missing values\n- Text cleaning and normalization\n- Removing duplicates\n- Lemmatization\n- Bag-of-Words generation\n\n## Text Transformation\nReviews are transformed into matrix form using **TF-IDF**, which captures both word frequency and importance across the dataset. This enhances the detection of fraud indicators hidden within review text.\n\n## Machine Learning Model: SVM\n**Support Vector Machine (SVM)** is used due to its robustness in high-dimensional text data. An **80–20 split** is applied:\n- 80% training\n- 20% testing\n\nSVM classifies review patterns to determine legitimate vs. suspicious activity.\n\n## Results\nA confusion matrix evaluates performance by comparing predicted vs. actual labels. The model achieved:\n\n### **✔ Accuracy: 98.8%**\n\nMismatches (False Positives and False Negatives) are strong fraud signals and are flagged for deeper analysis. Additional fraud cases are identified when repeated suspicious reviews originate from the same user or source.\n\n## Conclusion\nThis project demonstrates that combining **Generative AI + SVM** provides a highly accurate fraud detection system (98.8%). It significantly reduces financial risks by identifying suspect reviews and potential fraudulent activities. Future work may include deep learning models, real-time fraud detection, and advanced anomaly detection.\n\n---\nBased on the research paper and presentation delivered at **IEEE SILCON-2025**, NIT Nagaland."
  },
  {
    "slug": "security-shark-tank",
    "title": "Participating in Security Shark Tank with Robert Herjavec and CISOs",
    "date": "2016-11-17",
    "categories": ["TechNews"],
    "img": "assets/sharktank.jpg",
    "excerpt": "Serving as a 'Shark' during RSA week and takeaways from rapid-fire vendor pitches.",
    "content": "## Security Shark Tank notes\n\nFast pitches. Faster follow-ups. A reminder that clear problem definition beats feature lists."
  },
  {
    "slug": "global-big-data-2016",
    "title": "Speaking at Global Big Data Conference 2016",
    "date": "2016-11-12",
    "categories": ["TechNews"],
    "img": "assets/bigdata.jpg",
    "excerpt": "Securing Apache Kafka - notes, links, and interview.",
    "content": "### Securing Apache Kafka\n\nField notes from hardening Kafka clusters at scale: network segmentation, authz/authn, encryption in transit, and sensible defaults."
  }
]
