[
  {
    "slug": "about-ganesh",
    "title": "About Me",
    "date": "2025-01-10",
    "featured": true,
    "comments": 0,
    "categories": ["Featured", "About"],
    "img": "",
    "excerpt": "Senior Software Engineer with 6 years of expertise in designing scalable web applications, cloud platforms (AWS, Azure, GCP), and Generative AI integration. Currently at Wells Fargo leading fraud detection modernization.",
    "content": "# Ganesh Vadlamuri\n\n**Senior Software Engineer | Cloud & AI Specialist**\n\nCharlotte, NC | ganeshvadlamuri.root@gmail.com | +1 512-665-3074\n\n---\n\n## SUMMARY\n\nSenior Software Engineer with 6 years of experience designing and deploying scalable enterprise applications using Java, Spring Boot, and cloud platforms (AWS, Azure, GCP). Expertise in microservices architecture, RESTful APIs, CI/CD pipelines, and database optimization. Currently leading fraud detection modernization at Wells Fargo with focus on cloud migration, security, and Generative AI integration.\n\n---\n\n## EDUCATION\n\n**Master of Science in Computer Science**\nTexas State University | San Marcos, TX | May 2024 | GPA: 3.5/4.0\n\n---\n\n## PROFESSIONAL EXPERIENCE\n\n### WELLS FARGO\n**Senior Software Engineer** | Charlotte, NC | Dec 2024 - Present\n\n- Lead fraud detection platform modernization including Java 11→17 upgrade and Spring Boot 3.x migration\n- Spearhead PCF to OpenShift migration PoC with containerization and cloud-native architecture\n- Partner with DevOps and Architecture teams for GCP deployment pipeline modernization\n- Implement BDD testing with Cucumber/Gherkin and enhance CI/CD with Jenkins, Docker, Artifactory\n- Build real-time fraud detection using Kafka, MongoDB, OracleDB with Splunk monitoring\n- Develop GenAI-powered PoC for fraud analytics and anomaly detection\n- Resolve critical security vulnerabilities ensuring compliance\n\n### TEXAS STATE UNIVERSITY\n**Graduate Software Engineer** | San Marcos, TX | Aug 2022 - May 2024\n\n- Maintained enterprise websites using Java, Spring Boot, Angular, React with microservices\n- Deployed cloud applications on AWS (EC2, RDS, S3) using Terraform IaC\n- Containerized applications with Docker and orchestrated with Kubernetes\n- Developed ETL pipelines and optimized MySQL/PostgreSQL databases\n- Created data visualizations in Tableau and Power BI analyzing student performance\n- Configured AWS CloudWatch for performance monitoring and alerts\n\n### AMAZON WEB SERVICES\n**Cloud Engineer** | Remote, India | Mar 2022 - May 2022\n\n- Designed scalable cloud solutions improving application performance\n- Configured AWS services (EC2, S3, RDS) with security optimization\n- Developed automation scripts using Python and AWS CLI\n- Implemented Infrastructure as Code with Terraform\n- Monitored infrastructure via AWS CloudWatch dashboards\n\n### KSR MARINE EXPORTS\n**Software Engineer** | Andhra Pradesh, India | Jan 2021 - Feb 2022\n\n- Built RESTful APIs integrating PostgreSQL and cloud storage (AWS S3, Azure Blob)\n- Implemented ETL pipelines using AWS Glue and Azure Data Factory\n- Developed interactive dashboards in Tableau and Power BI\n- Optimized SQL queries with SonarLint code quality checks\n- Deployed services via Jenkins and UrbanCode Deploy\n\n### GNR HEALTH CARE\n**Software Engineer (Data Systems)** | Andhra Pradesh, India | Aug 2018 - Dec 2020\n\n- Designed ETL pipelines for healthcare data processing ensuring HIPAA compliance\n- Analyzed billing and insurance claims data identifying discrepancies\n- Built Power BI and Tableau dashboards tracking KPIs\n- Optimized SQL queries reducing report generation time by 30%\n- Automated recurring reports eliminating 40% manual effort\n- Integrated RESTful APIs for real-time claim status updates\n\n---\n\n## KEY PROJECTS\n\n**AWS Superstore Data Analysis Pipeline**\nEnd-to-end sales data pipeline using AWS S3, Glue, Athena, QuickSight with IAM security\n\n**Car Sales Dashboard with Power BI**\nInteractive dashboard tracking KPIs, sales trends, YOY growth by body style, color, region\n\n---\n\n## LEADERSHIP & ACHIEVEMENTS\n\n- Volunteer, Rotary Club International - Plastic reduction initiatives\n- Success Coach, Texas State University - US Seminar Class\n- NSS Organizer - Blood donation camps, beach cleanups, village development\n- Event Lead - \"Tarang\" festival (1,700+ attendees, hackathons, workshops)\n\n---\n\n## CONNECT\n\n[Schedule Meeting](https://calendly.com/ganeshvadlamuri-root/30min) | [LinkedIn](https://linkedin.com/in/ganeshvadlamuri) | [GitHub](https://github.com/ganeshvadlamuri)\n\n*Updated: January 2025*"
  },
  {
  "slug": "ieee-silcon-2025-presentation",
  "title": "Financial Fraud Detection in Shopping Sites using Generative AI",
  "date": "2025-11-08",
  "categories": ["Conference", "Research"],
  "img": "assets/IeeeFraudDetection.png",
  "excerpt": "Presented a research paper at the 2025 IEEE Silchar Subsection Conference (SILCON-2025) organized by NIT Nagaland.",
  "content": "## Introduction\nOnline shopping has grown rapidly, especially after the COVID-19 pandemic. With increased dependency on digital payments and home deliveries, financial fraud has also risen. Fraud often occurs through manipulated deliveries, misleading reviews, or unauthorized access. Prior research shows that nearly **25% of online transactions are wrongly declined**, and younger customers are more vulnerable to fraud. This motivated the development of an AI-driven fraud detection system.\n\n## Motivation\nTraditional, rule-based fraud detection methods are limited and cannot handle complex, evolving fraud patterns. This project integrates **Generative AI** with machine learning to:\n- Identify emotional tone and hidden patterns in product reviews.\n- Analyze user behavior to detect anomalies.\n- Provide a data-driven framework that adapts to new fraud techniques.\n\n## Dataset Used\nThe dataset is sourced from the **Kaggle Amazon Product Reviews** repository with **568,454 reviews** and **10 features** (seller details, payment data, product info, reviews, etc.). Preprocessing includes:\n- Removing unnecessary columns\n- Handling missing values\n- Text cleaning and normalization\n- Removing duplicates\n- Lemmatization\n- Bag-of-Words generation\n\n## Text Transformation\nReviews are transformed into matrix form using **TF-IDF**, which captures both word frequency and importance across the dataset. This enhances the detection of fraud indicators hidden within review text.\n\n## Machine Learning Model: SVM\n**Support Vector Machine (SVM)** is used due to its robustness in high-dimensional text data. An **80–20 split** is applied:\n- 80% training\n- 20% testing\n\nSVM classifies review patterns to determine legitimate vs. suspicious activity.\n\n## Results\nA confusion matrix evaluates performance by comparing predicted vs. actual labels. The model achieved:\n\n### **✔ Accuracy: 98.8%**\n\nMismatches (False Positives and False Negatives) are strong fraud signals and are flagged for deeper analysis. Additional fraud cases are identified when repeated suspicious reviews originate from the same user or source.\n\n## Conclusion\nThis project demonstrates that combining **Generative AI + SVM** provides a highly accurate fraud detection system (98.8%). It significantly reduces financial risks by identifying suspect reviews and potential fraudulent activities. Future work may include deep learning models, real-time fraud detection, and advanced anomaly detection.\n\n---\nBased on the research paper and presentation delivered at **IEEE SILCON-2025**, NIT Nagaland."
  }
]
